TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/OpenJourneyPlanner/V1/Locality.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <PlanJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.OpenJourneyPlanner.V1">
            <transactionId>testOpenJP</transactionId>
            <language>en-GB</language>
            <request>
                <ModeFilter>
                    <Include>true</Include>
                    <Modes>
                        <TransportMode>
                            <Mode>Drt</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Rail</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Bus</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Coach</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Metro</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Underground</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Tram</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Ferry</Mode>
                        </TransportMode>
                        <TransportMode>
                            <Mode>Air</Mode>
                        </TransportMode>
                    </Modes>
                </ModeFilter>
                <Depart>true</Depart>
                <Destination>
                    <Coordinate>
                        <Easting>531261</Easting>
                        <Northing>182230</Northing>
                    </Coordinate>
                    <GivenName>EC1R 3HN</GivenName>
                    <Locality>N0065138</Locality>
                    <Stops>
                        <RequestStop>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                    </Stops>
                    <Type>Locality</Type>
                </Destination>
                <Origin>
                    <Coordinate>
                        <Easting>467632</Easting>
                        <Northing>171761</Northing>
                    </Coordinate>
                    <GivenName>RG31 7PE</GivenName>
                    <Locality>N0071770</Locality>
                    <Stops>
                        <RequestStop>
                            <TimeDate>2014-04-29T15:00:00.0000000+01:00</TimeDate>
                        </RequestStop>
                    </Stops>
                    <Type>Locality</Type>
                </Origin>
                <PublicParameters>
                    <Algorithm>Default</Algorithm>
                    <InterchangeSpeed>0</InterchangeSpeed>
                    <IntermediateStops>All</IntermediateStops>
                    <MaxWalkDistance>2000</MaxWalkDistance>
                    <RangeType>Sequence</RangeType>
                    <Sequence>3</Sequence>
                    <TrunkPlan>false</TrunkPlan>
                    <WalkSpeed>80</WalkSpeed>
                </PublicParameters>
            </request>
        </PlanJourney>
    </soap:Body>
</soap:Envelope>